# Brewfile — All Homebrew installs
# Run: brew bundle --file=Brewfile

# --- System ---
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "tree"
brew "htop"

# --- Shell ---
brew "zsh"
brew "tmux"
brew "neovim"
brew "starship"
brew "chezmoi"
cask "iterm2"

# --- Languages ---
brew "nvm"
brew "pyenv"
brew "go"
brew "rustup"
# SDKMAN handles Java/Scala — not via Homebrew

# --- Dev Tools ---
brew "gh"                    # GitHub CLI
brew "bats-core"             # Shell testing
cask "docker"
cask "visual-studio-code"

# --- AI Tools ---
cask "cursor"

# --- Remote Access ---
cask "tailscale"

# --- Fonts (for terminal) ---
cask "font-jetbrains-mono-nerd-font"
